//
//  PickerView.swift
//  6bann
//
//  Created by 橋目　那桜 on 2020/08/08.
//  Copyright © 2020 橋目　那桜. All rights reserved.
//

import UIKit

class PickerView: UIViewController, UIPickerViewDelegate, UIPickerViewDataSource {
    @IBOutlet var label: UILabel!
    var onej = ["シネラリア","","","","",]
    var onec = ["シネラリア","","","","",]
    var oneg = ["シネラリア","","","","",]
    var twoj = ["シネラリア","","","","",]
    var twoc = ["シネラリア","","","","",]
    var twog = ["シネラリア","スイートアリッサム","","","",]
    var threej = ["ムスカリ（青）","ムスカリ（紫）","ムスカリ（白）","シネラリア","スイートアリッサム","","","","","",]
    var threec = ["ムスカリ（青）","ムスカリ（紫）","ムスカリ（白）","シネラリア","スイートアリッサム",]
    var threeg = ["ソメイヨシノ","シダレザクラ","ムスカリ（青）","ムスカリ（紫）","ムスカリ（白）","ネモフィラ","シネラリア","スイートアリッサム","","","",]
    var fourj = ["ソメイヨシノ","シダレザクラ","ムスカリ（青）","ムスカリ（紫）","ムスカリ（白）","ネモフィラ","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","シネラリア","スイートアリッサム","スミレ(菫)","ベルフラワー","","","","","","",]
    var fourc = ["ソメイヨシノ","ヤエザクラ","シダレザクラ","ムスカリ（青）","ムスカリ（紫）","ムスカリ（白）","ネモフィラ","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","シネラリア","スイートアリッサム","スミレ(菫)","ベルフラワー","","","","","","",]
    var fourg = ["ソメイヨシノ","ヤエザクラ","シダレザクラ","アマリリス（赤）","アマリリス（ピンク）","アマリリス（白）","ムスカリ（青）","ムスカリ（紫）","ムスカリ（白）","ネモフィラ","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","シネラリア","スイートアリッサム","ブルーベル","スミレ(菫)","ベルフラワー","","","","","","",]
    var fivej = ["ソメイヨシノ","ヤエザクラ","アマリリス（赤）","アマリリス（ピンク）","アマリリス（白）","アマリリス（黄色）","ムスカリ（青）","ムスカリ（紫）","ムスカリ（白）","ブルースター","ネモフィラ","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","アヤメ（紫）","アヤメ（白）","シネラリア","スイートアリッサム","チョコレートコスモス","ブルーベル","スミレ(菫)","ベルフラワー","","","","",]
    var fivec = ["赤バラ","白バラ","ピンクローズ","青バラ","黄バラ","オレンジローズ","黒バラ","アマリリス（赤）","アマリリス（ピンク）","アマリリス（白）","アマリリス（黄色）","ブルースター","ネモフィラ","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","アヤメ（紫）","アヤメ（白）","シネラリア","スイートアリッサム","チョコレートコスモス","スミレ(菫)","ベルフラワー","グリーンローズ","パープルローズ","","","","","","","",]
    var fiveg = ["赤バラ","白バラ","ピンクローズ","青バラ","黄バラ","オレンジローズ","黒バラ","アマリリス（赤）","アマリリス（ピンク）","アマリリス（白）","アマリリス（黄色）","ブルースター","ネモフィラ","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","アヤメ（紫）","アヤメ（白）","シネラリア","スイートアリッサム","チョコレートコスモス","スミレ(菫)","百合(ユリ)","ベルフラワー","グリーンローズ","パープルローズ","","","","","","",]
    var sixj = ["赤バラ","白バラ","ピンクローズ","青バラ","黄バラ","オレンジローズ","黒バラ","アマリリス（赤）","アマリリス（ピンク）","アマリリス（白）","アマリリス（黄色）","ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","スイートアリッサム","チョコレートコスモス","百合(ユリ)","グリーンローズ","パープルローズ","アンズ","","","","",]
    var sixc = ["赤バラ","白バラ","ピンクローズ","青バラ","黄バラ","オレンジローズ","黒バラ","アマリリス（赤）","アマリリス（ピンク）","アマリリス（白）","アマリリス（黄色）","ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","ヤマボウシ（緑）","ヤマボウシ（ピンク）","ヤマボウシ（白）","チョコレートコスモス","百合(ユリ)","グリーンローズ","パープルローズ","アンズ","","","","","","","","","","",]
    var sixg = ["アマリリス（赤）","アマリリス（ピンク）","アマリリス（白）","アマリリス（黄色）","ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","ヤマボウシ（緑）","ヤマボウシ（ピンク）","ヤマボウシ（白）","チョコレートコスモス","百合(ユリ)","アンズ","","","","","","","","",]
    var sevenj = ["ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","ヤマボウシ（緑）","ヤマボウシ（ピンク）","ヤマボウシ（白）","チョコレートコスモス","ひまわり(向日葵)","百合(ユリ)","アンズ","","","","","",]
    var sevenc = ["ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","ヤマボウシ（緑）","ヤマボウシ（ピンク）","ヤマボウシ（白）","チョコレートコスモス","ひまわり(向日葵)","百合(ユリ)","アンズ","","","","","",]
    var seveng = ["ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","チョコレートコスモス","ひまわり(向日葵)","百合(ユリ)","","","","","","",]
    var eightj = ["ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","チョコレートコスモス","ひまわり(向日葵)","","","","","","","",]
    var eightc = ["ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","チョコレートコスモス","ひまわり(向日葵)","","","","","","","",]
    var eightg = ["ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","チョコレートコスモス","ひまわり(向日葵)","","","","","","","",]
    var ninej = ["ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","チョコレートコスモス","ひまわり(向日葵)","","","","","","","",]
    var ninec = ["ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","チョコレートコスモス","ひまわり(向日葵)","","","","","","","",]
    var nineg = ["ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","スイートアリッサム","チョコレートコスモス","ひまわり(向日葵)","","","","","","",]
    var tenj = ["アマリリス（赤）","アマリリス（ピンク）","アマリリス（白）","アマリリス（黄色）","ブルースター","ガザニア（黄）","ガザニア（白）","ガザニア（オレンジ）","ガザニア（ピンク）","ガザニア（赤）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","スイートアリッサム","チョコレートコスモス","","","","","","","","",]
    var tenc = ["赤バラ","白バラ","ピンクローズ","青バラ","黄バラ","オレンジローズ","黒バラ","アマリリス（赤）","アマリリス（ピンク）","アマリリス（白）","アマリリス（黄色）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","スイートアリッサム","チョコレートコスモス","グリーンローズ","パープルローズ","","","","","","","",]
    var teng = ["赤バラ","白バラ","ピンクローズ","青バラ","黄バラ","オレンジローズ","黒バラ","アマリリス（赤）","アマリリス（ピンク）","アマリリス（白）","アマリリス（黄色）","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","スイートアリッサム","チョコレートコスモス","グリーンローズ","パープルローズ","",""]
    var eievenj = ["赤バラ","白バラ","ピンクローズ","青バラ","黄バラ","オレンジローズ","黒バラ","アブチロン（オレンジ）","アブチロン（ピンク）","アブチロン（赤）","シネラリア","スイートアリッサム","チョコレートコスモス","イチョウ","グリーンローズ","パープルローズ","","","","",]
    var eievenc = ["赤バラ","白バラ","ピンクローズ","青バラ","黄バラ","オレンジローズ","黒バラ","シネラリア","スイートアリッサム","チョコレートコスモス","イチョウ","グリーンローズ","パープルローズ","","","","",]
    var eieveng = ["赤バラ","白バラ","ピンクローズ","青バラ","黄バラ","オレンジローズ","黒バラ","シネラリア","スイートアリッサム","チョコレートコスモス","イチョウ","グリーンローズ","パープルローズ","","","","",]
    var twelvej = ["シネラリア","スイートアリッサム","","","",]
    var twelvec = ["シネラリア","","","","",]
    var twelveg = ["シネラリア","","","","",]
    var huteiki = ["ファレノプシス（胡蝶蘭）","","","","",]
    var itinenn = ["ハゲイトウ","","","","",]
    
    
    
    
    
        
    @IBOutlet var pickerView: UIPickerView!
        
        // たくさん卒業してしまった...
    let dataList = ["１月上旬","１月中旬","１月下旬","2月上旬","2月中旬","2月下旬","3月上旬","3月中旬","3月下旬","4月上旬","4月中旬","4月下旬","5月上旬","5月中旬","5月下旬","6月上旬","6月中旬","6月下旬","7月上旬","7月中旬","7月下旬","8月上旬","8月中旬","8月下旬","9月上旬","9月中旬","9月下旬","10月上旬","10月中旬","10月下旬",
        "11月上旬","11月中旬","11月下旬","12月上旬","12月中旬","12月下旬","不定期","一年草"]
        
        
        override func viewDidLoad() {
            super.viewDidLoad()
            
            // Delegate設定
            pickerView.delegate = self
            pickerView.dataSource = self
            
            label.text = "花を月で絞る"
            
        }
        
        // UIPickerViewの列の数
        func numberOfComponents(in pickerView: UIPickerView) -> Int {
            return 1
        }
        
        // UIPickerViewの行数、リストの数
        func pickerView(_ pickerView: UIPickerView,
                        numberOfRowsInComponent component: Int) -> Int {
            return dataList.count
        }
        
        // UIPickerViewの最初の表示
        func pickerView(_ pickerView: UIPickerView,
                        titleForRow row: Int,
                        forComponent component: Int) -> String? {
            
            return dataList[row]
        }
        
        // UIPickerViewのRowが選択された時の挙動
        func pickerView(_ pickerView: UIPickerView,
                        didSelectRow row: Int,
                        inComponent component: Int) {
            
            label.text = dataList[row]
            
        }
        
    }

    





